Bwooce/iridium_acars/p4-usb-host/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# Build with -O2. Default IDF target picks "Debug" (-Og) which is awful for
# scalar DSP loops — the windowing, magnitude, and EMA loops measured 4×
# slower under -Og than the same code at -O2. Cost: a slightly larger
# binary (still well within the 1 MB app partition) and slightly worse
# stepping behaviour in gdb. Worth it.
# (IDF v6.1 only exposes Debug/Size/Performance/None as choices; no LTO
# option in Kconfig. Per-file aggressive flags are applied via the main
# CMakeLists.txt for the DSP hot files.)
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_SPIRAM=y
CONFIG_SPIRAM_TYPE_OCTAL=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
# Bumped from 32 KB so driver-side internal allocations don't spill into
# PSRAM (which would add load on the AXI bus that DSP and worker share).
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# Bigger L2 cache. Default was 128 KB; baseline[] (8 KB) + magnitudes[] (8 KB)
# + window_cplx (8 KB) + USB ringbuffer working-set don't co-exist cleanly in
# 128 KB and were thrashing during the baseline EMA.
#
# 512 KB ate 384 KB of internal SRAM heap and broke init (convert_buf malloc
# failed silently). 256 KB only takes 128 KB of internal SRAM and is still 2x
# the default — covers the DSP hot working set without starving heap.
CONFIG_CACHE_L2_CACHE_256KB=y

# FreeRTOS runtime stats so we can see %CPU per task per core. Required to
# answer "is Core 1 actually idle / where is Core 0 spending its time".
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
# xCoreID field in TaskStatus_t for the per-task dump.
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Watchdog tuning. The class_driver task on Core 0 is intentionally hot
# (drains the USB ringbuffer continuously); IDLE0 effectively never runs.
# Stop watching either IDLE task so legitimate full-load operation isn't a
# false-positive. Worker (Core 1) processes 200+ bursts/sec under flood and
# legitimately starves IDLE1; the previous "IDLE1 stays watched as a sanity
# check" tripped TWDT panics that the USB-CDC log doesn't capture (the
# panic dump goes to the dedicated UART pins). We don't use vTaskDelete,
# idle hook, or power policy — nothing relies on idle running.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
# Backtrace + coredump on real WDT events instead of silent reset.
CONFIG_ESP_TASK_WDT_PANIC=y
# Per-task heap usage for diagnosing leaks under load. Left off for now —
# initial enable triggered an Interrupt WDT timeout on CPU1 during boot,
# probably from per-alloc critical sections piling up during the worker's
# big PSRAM allocations. Re-enable later if specifically debugging heap.
# CONFIG_HEAP_TASK_TRACKING=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
